{
    "articles": [
        {
            "news_text": "Stock futures jump after tame inflation report: Live updates - CNBC. U.S. and Chinese officials reached a consensus on trade after a second day of talks in London.. Stock futures rose on Wednesday on the back of soft U.S. inflation data. Investors also kept an eye out for new developments on the trade policy consensus between the U.S. and China. \r\nFutures tied t… [+1921 chars]",
            "headlines": [
                {
                    "headline": "Stock futures are still rising, but trading is still sluggish, according to the Wall Street Journal, which also reported that the consensus about a U.S.-China trade agreement is still out of sync.      \nCNBC said that",
                    "score": 0.9966
                },
                {
                    "headline": "... and the \"market-leading\" U.S. equities futures dropped to a new low on Wednesday.   After a week of strong U.S. policy, China saw the best chance to keep it out of the U.",
                    "score": 0.9987
                },
                {
                    "headline": "Market:  U.S. economic growth: \"Futures are high now. GDP growth is solid. It's all about inflation. The U.S. economy is growing. We're back to our old ways of doing",
                    "score": 0.9984
                }
            ]
        },
        {
            "news_text": "Capitol agenda: The GOP’s latest megabill casualties - Politico. House Republicans will vote to ax some of their previous megabill proposals as the Senate's “Byrd bath” looms..",
            "headlines": [
                {
                    "headline": "The GOP's latest megabill casualties - Politico. House Republicans will vote to ax some of their previous megabill proposals as the Senate's “Byrd bath” looms.. \nHouse Republicans are still considering the next",
                    "score": 0.9989
                },
                {
                    "headline": "Trump's new legislative budget includes huge cuts to Medicare, Medicaid, and Social Security, as Republicans vow to fight for 'tax cuts for the middle class' \nSenate GOP says it will move to gut Obamacare in next year's budget\nRep.",
                    "score": 0.995
                },
                {
                    "headline": "The GOP’s latest megabill casualties - Politico. House Republicans will vote to ax some of their previous megabill proposals as the Senate's “Byrd bath” looms..   https://politi.co/",
                    "score": 0.9953
                }
            ]
        },
        {
            "news_text": "Nintendo’s Switch 2 is the fastest-selling game console of all time - The Verge. Nintendo is already breaking records with the Switch 2. The console has sold more than 3.5 million units in just four days.. The Switch 2 has reached a record-breaking 3.5 million units sold in just four days.\r\nNintendo was expecting the Switch 2 would be just as successful as the original, and its already become the faste… [+2288 chars]",
            "headlines": [
                {
                    "headline": "Nintendo’s Switch 2 is the fastest-selling game console of all time - The Verge. Nintendo is already breaking records with the Switch 2. The console has sold more than 3.5 million units in just four days.. The Switch 2",
                    "score": 0.9992
                },
                {
                    "headline": "Nintendo is already breaking records with the Switch 2, and its already become the fastest-selling game console of all time. Nintendo is already breaking records with the Switch 2. The console has sold more than 3.5 million units in just four days.",
                    "score": 0.9968
                },
                {
                    "headline": "Nintendo will launch the Wii U Switch next year\nWhat do you think of Nintendo's move to the Switch? Comment below or on Reddit.\nThe Verge is a news site that covers tech and news. It is based in San Francisco, California",
                    "score": 0.9974
                }
            ]
        },
        {
            "news_text": "Here are the winners and losers as the UK unveils spending plans - CNBC. U.K. Chancellor Rachel Reeves is delivering her Spending Review this Wednesday, detailing how public money will be divided between government departments.. U.K.Chancellor of the Exchequer Rachel Reeves leaves 10 Downing Street ahead of PMQs in the House of Commons in London, United Kingdom on June 11, 2025. \r\nU.K. Chancellor Rachel Reeves is delivering … [+7020 chars]",
            "headlines": [
                {
                    "headline": "The Chancellor of the Exchequer Rachel Reeves (left) is delivering a spending review for the UK on Tuesday, June 11, 2025. arie-\nU.K. Chancellor Rachel Reeves delivers a Spending Review for the UK on Tuesday, June",
                    "score": 0.9951
                },
                {
                    "headline": "\"We Will Have The Most Powerful House in the World\"  - New York Times  - U.K. Chancellor Rachel Reeves is delivering her Spending Review this Wednesday, detailing how public money will be divided between government departments.. U.K",
                    "score": 0.9988
                },
                {
                    "headline": "The Conservatives have announced that the government will cut the UK's tax rate by 10 per cent from 20 per cent for 2015-16, after they said the rate would be cut by 20 per cent at the next election. The UK is facing an ageing",
                    "score": 0.9958
                }
            ]
        },
        {
            "news_text": "She was a Disney star with platinum records, but Bridgit Mendler gave it up to change the world - Ars Technica. “The space industry has a ground bottleneck, and the problem is going to get worse.”….",
            "headlines": [
                {
                    "headline": "\"The future of Hollywood's star power and influence is at stake\" [The Verge, 4/25/13]\n\nRelated: 'Beauty and the Beast' Director Spike Jonze Reveals the Plot to 'The Big Lebowski",
                    "score": 0.9957
                },
                {
                    "headline": "In a world where you can't afford to hire people from other industries, you have to hire other people from the ground.\n\nWhat is it about Disney and Hollywood that makes them so successful? They can't afford to hire a whole bunch of",
                    "score": 0.9914
                },
                {
                    "headline": "【The space industry has a ground bottleneck, and the problem is going to get worse.】\n\nIn the movie version of the trailer, she's a woman who's always looking out for herself, and while she doesn't like being on",
                    "score": 0.9972
                }
            ]
        }
    ]
}